Revit 2024 API
NumberingSchema.GetNumberingSequences Method
 Returns all numbering sequences within this numbering schema.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public IList<string> GetNumberingSequences()
Visual Basic
Public Function GetNumberingSequences As IList(Of String)
Visual C++
public:
IList<String^>^ GetNumberingSequences()
Return Value
 A collection of partition names of all numbering sequences currently present in this schema.
Remarks
The collection may be empty if there are no elements yet in this schema.
One of the strings can be an empty string, which would indicate presence of the default partition into which elements automatically belong if left unassigned to any other partition
See Also
NumberingSchema Class
Autodesk.Revit.DB Namespace